Revit 2027 API
TextRange(Int32, Int32) Constructor
 Constructs a TextRange with input start and length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TextRange(
	int start,
	int length
)
Public Sub New (
	start As Integer,
	length As Integer
)
public:
TextRange(
	int start,
	int length
)
new :
        start : int *
        length : int -> TextRange
Parameters
start Int32
length Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for start is negative. -or- The given value for length is negative.
Remarks
 The input value for start as well as length should not be negative.
See Also
Reference
TextRange Class
TextRange Overload
Autodesk.Revit.DB Namespace